<?php


namespace App\classes;


class Products
{
    public $products=[],$product,$data=[];
    public function __construct()
    {
        $this->products=[
            0=>[
                "id"=>1,
                'category_id'=>1,
                'name'=>'আকাশে এখনো কোনো অ্যালবাট্রস পাখির দেখা মেলেনি',
                'image'=>'assets/img/1.jpg',

                'description_one'=>'সব মিলিয়ে ১২ দিনের অভিযাত্রা। এর মধ্যে যেতে-আসতেই ছয় দিন শেষ।
                 অ্যান্টার্কটিকার সাগর-উপসাগরে ঘুরে ঘুরে কেটেছে বাকি ছয় দিন। কখনো কখনো জাহাজ থেকে নেমে ছোট নৌকায় ভেসে
                 ভেসে দেখেছেনপেঙ্গুইনের কীর্তিকলাপ,কখনো বরফঢাকা অ্যান্টার্কটিকার ওপর করেছেন হাইকিং। অ্যান্টার্কটিকা অভিযাত্রার
                 সেই গল্প শোনাচ্ছেন মহুয়া রউফ। আজ পড়ুন চতুর্থ পর্ব',

                'description_two'=>'জাহাজে দুটি লাউঞ্জ। তিনতলার লাউঞ্জটিতে নানা ধরনের উপস্থাপন, সিনেমা প্রদর্শন,
                 বক্তৃতা চলতেই থাকে। আর চারতলার লাউঞ্জটা পানশালা। অভিজাত বললে বাড়িয়ে বলা হবে না। এক কোনায়
                  পাতা আছে একটি পিয়ানো। রবীন্দ্রনাথের আর্জেন্টাইন অনুরাগী ভিক্টোরিয়া ওকাম্পোর পিয়ানোটা দেখতে যেমন, ঠিক তেমন।
                   আরেক পাশে কফির আধুনিক সরঞ্জামাদি। নানা ঢঙের কফি। সবটা আমি বুঝিও না ঠিকমতো। পাশেই কাপ-পিরিচ সাজানো 
                   আছে। পাশে ছোট্ট একটা টেবিল পাতা, তাতে নানা পদের কুকিজ। ব্যাংক কিংবা টেলিকমিউনিকেশন অফিসের 
                   কাস্টমার কেয়ারের মতো এটি ২৪ ঘণ্টাই খোলা থাকে। অবস্থাদৃষ্টে মনে হচ্ছে, অভিযাত্রীদের এরা অ্যান্টার্কটিকার পানি 
                   কিংবা বরফে না মারলেও খাইয়ে মারবে।',
            ],
            1=>[
                "id"=>2,
                'category_id'=>1,
                'name'=>'৫৪ বছর বয়সে এভারেস্ট ম্যারাথনে ',
                'image'=>'assets/img/2.jpg',

                'description_one'=>'মো. মনিরুজ্জামানের বয়স প্রায় ৫৪ বছর। তাঁর বয়স দিয়েই যে এই প্রতিবেদন শুরু করতে হলো,
                 তার কারণ আছে। ',

                'description_two'=>'পঞ্চাশোর্ধ্ব মনিরুজ্জামান গত ২৯ মে এভারেস্ট ম্যারাথনে অংশ নিয়ে পূর্ণ দূরত্বের পুরো পর্বটি সফলভাবে
                  শেষ করেছেন।২৯ মে ছিল এভারেস্ট দিবস। ১৯৫৩ সালের এই দিনেই এডমুন্ড হিলারি এবং তেনজিং নরগে শেরপা বিশ্বের 
                  সবচেয়ে উঁচু পর্বতশৃঙ্গ এভারেস্ট প্রথমবার জয় করেছিলেন। এভারেস্ট দিবসে দুই বছর পরপর আয়োজন করা হয় 
                  ‘তেনজিং-হিলারি এভারেস্ট ম্যারাথন’। নেপাল সরকারের সহায়তায় হিমালয়ান এক্সপিডিশন এর আয়োজক। এটিই পৃথিবীর 
                  সবচেয়ে উঁচু ট্রেইল ম্যারাথন।এভারেস্ট ম্যারাথন শেষ করে মনিরুজ্জামান ঢাকায় ফিরে এসেছেন ১ জুন। ম্যারাথন সম্পন্ন 
                  করার সনদ আর পদক হাতে সেদিনই সন্ধ্যায় এলেন প্রথম আলো কার্যালয়ে। বিস্তারিত বললেন তাঁর রোমাঞ্চকর
                   এই অভিযাত্রা নিয়ে।',
            ],
            2=>[
                "id"=>3,
                'category_id'=>2,
                'name'=>'মানিকগঞ্জে কেঁচো সারে স্বাবলম্বী হচ্ছেন গ্রামের নারীরা',
                'image'=>'assets/img/3.jpg',

                'description_one'=>'নিজের কিংবা সংসারের সামান্য জিনিস কিনতে স্বামীর ওপর ভরসা করতে হতো মনোয়ারা বেগমের (৪৮)।
                 দরিদ্র কৃষক স্বামীর হাতে টাকাপয়সা থাকত না সব সময়। তবে মনোয়ারাকে এখন আর স্বামীর কাছে টাকা চাইতে হয় না; 
                 নিজেই এখন উপার্জন করছেন। বাড়িতে কেঁচো সার (ভার্মি কম্পোস্ট) উৎপাদন করে স্বাবলম্বী হয়েছেন মানিকগঞ্জের সিঙ্গাইর 
                 উপজেলার গোলাই গ্রামের কৃষক ফারুক হোসেনের স্ত্রী মনোয়ারা বেগম।',

                'description_two'=>'শুধু মনোয়ারা বেগম নন, কেঁচো সার উৎপাদন ও বিক্রি করে সংসারের অভাব ঘুচিয়েছেন গোলাই
                 গ্রামের বেশ কয়েকজন নারী। প্রায় ১০ বছর আগে সংগঠন তৈরির মাধ্যমে বাণিজ্যিকভাবে কেঁচো সারে এ গ্রামের নারীদের
                  অনেকে এখন স্বাবলম্বী।মনোয়ারা বেগম বলেন, ২০১৪ সালের মে মাসে নিজের বাড়িতে মাটির বড় পাত্রে (চাড়ি)
                   এই জৈব সার তৈরি শুরু করেন। নিজেদের দুটি গরু রয়েছে। এ গরুর গোবর, টুকরো টুকরো করা কলাগাছ,
                    কচুরিপানা ও ৫০০ গ্রাম কেঁচো দিয়ে সার তৈরি শুরু করেন। এতে তাঁর খরচ পড়ে মাত্র ৩০০ টাকা। তিনি আরও 
                    বলেন, ৪০ দিন পর প্রতিটি চাড়িতে ২ মণ করে কেঁচো সার তৈরি হয়। প্রতি কেজি কেঁচো সার বিক্রি হয় ১২ টাকায়। 
                    চারটি চাড়ি থেকে উৎপাদিত কেঁচো সার বিক্রি করে তিনি পেয়েছিলেন চার হাজার টাকার মতো।',
            ],
            3=>[
                "id"=>4,
                'category_id'=>2,
                'name'=>'যশোরে কম উচ্চতার ১১ সেতুতে ‘নদী হত্যা’',
                'image'=>'assets/img/4.jpg',
                'description_one'=>'ভৈরব নদের পর এবার যশোরের আরও সাতটি নদীর ওপর কম উচ্চতার ১১টি সেতু নির্মাণ করা হচ্ছে।
                 সেতুগুলো নিচু হওয়ার কারণে বর্ষায় এসব সেতুর নিচ দিয়ে নৌযান চলাচল ব্যাহত হওয়ার আশঙ্কা করা হচ্ছে। 
                 বিআইডব্লিউটিএর ছাড়পত্র না নিয়ে সরকারের দুটি প্রতিষ্ঠান সেতুগুলো নির্মাণ করছে।',

                'description_two'=>'এর আগে ভৈরব নদের ওপর ৫১টি ‘অপরিকল্পিত’ সেতু-কালভার্ট নির্মাণ করা হয়। এ নিয়ে 
                ২০২১ সালের ১৫ জুলাই প্রথম আলোয় ‘নদের টুঁটি চেপে ধরেছে ৫১টি সেতু-কালভার্ট’ শিরোনামে প্রতিবেদন প্রকাশিত হয়।
                এখন যে সাতটি নদীর ওপর সেতু নির্মাণ করা হচ্ছে নিয়ম অনুযায়ী সেগুলোর কোনোটির ক্ষেত্রে সেতুর উচ্চতা হওয়ার কথা
                 পানির স্তর থেকে গার্ডারের নিচ পর্যন্ত ১৬ ফুট, কোনোটির ২৫ ফুট। কিন্তু যে ১১টি সেতু নির্মাণ করা হচ্ছে তার সব কটির 
                 উচ্চতা ৪ দশমিক ৫৯ ফুট থেকে ১১ দশমিক ৫০ ফুট পর্যন্ত। সেতুগুলোর মধ্যে ১০টি সেতু নির্মাণ করছে স্থানীয় সরকার 
                 প্রকৌশল অধিদপ্তর (এলজিইডি) এবং একটি সেতু নির্মাণ করা হচ্ছে সড়ক ও জনপথ অধিদপ্তরের (সওজ) ওয়েস্টার্ন 
                 বাংলাদেশ ব্রিজ ইমপ্রুভমেন্ট প্রজেক্টের (ডব্লিউবিবিআইপি) আওতায়। ',
            ],
            4=>[
                "id"=>5,
                'category_id'=>3,
                'name'=>'জনগণের জীবনযাত্রা স্বস্তিকর করার লক্ষ্য নেই বাজেটে: জাতীয় মুক্তি কাউন্সিল',
                'image'=>'assets/img/5.jpg',

                'description_one'=>'প্রস্তাবিত বাজেটে সাধারণ জনগণের জীবনযাত্রা স্বস্তিকর করার লক্ষ্য নেই বলে দাবি করেছে
                 জাতীয় মুক্তি কাউন্সিল। শুক্রবার দলটির সম্পাদক ফয়জুল হাকিমের দেওয়া এক বিবৃতিতে এ দাবি করা হয়েছে।',

                'description_two'=>' প্রস্তাবিত বাজেটের প্রতিক্রিয়ায় বিবৃতিতে বলা হয়েছে, পদে পদে ভ্যাট ও করের জাল বিছিয়ে 
                বাজেটে জনগণের পকেট কাটার ব্যবস্থা করা হয়েছে। চাল, ডাল, তেলসহ নিত্যপ্রয়োজনীয় দ্রব্যের লাগামহীন মূল্যবৃদ্ধিকে
                 প্রস্তাবিত বাজেট আরও ত্বরান্বিত করবে। সাধারণ জনগণের দুর্দশা ও দুর্ভোগ আরও বাড়বে বলেও বিবৃতিতে দাবি করা হয়েছে।',
            ],
            5=>[
                "id"=>6,
                'category_id'=>3,
                'name'=>'পুলিশ ঝামেলা করলে ভিডিও রাখবেন, ছবি রাখবেন',
                'image'=>'assets/img/6.jpg',

                'description_one'=>'পুলিশ বা সরকারি কোনো সংস্থা ঝামেলা করলে তার ‘ভিডিও’ এবং ‘ছবি’ নিয়ে রাখতে নেতা-কর্মীদের
                 নির্দেশনা দিয়েছেন বিএনপির স্থায়ী কমিটির সদস্য মির্জা আব্বাস। আজ শুক্রবার দুপুরে ঢাকার নয়াপল্টনে দলের প্রতিষ্ঠাতা 
                 জিয়াউর রহমানের মৃত্যুবার্ষিকী উপলক্ষে এক দোয়া মাহফিল ও তবারক বিতরণ অনুষ্ঠানে তিনি এ নির্দেশনা দেন।',

                'description_two'=>' দীর্ঘদিন ধরে নেতা-কর্মীদের গ্রেপ্তার ও হয়রানির ঘটনার উল্লেখ করে মির্জা আব্বাস বলেন,
                 ‘পুলিশ ভাইয়েরা, আপনারা আমাদের গ্রেপ্তার করেন, ধরে নিয়ে যান, কষ্ট দেন। এতে বিএনপির নেতা-কর্মীদের মনে
                  অনেক ক্ষোভ থাকতে পারে। সে ক্ষোভ নিরসনের লক্ষ্যে বলব, সব পুলিশ কিন্তু এক রকম না। কিছু পুলিশ ভালো আছে,
                   কিছু পুলিশ খারাপ আছে। যে লোকগুলো, যে প্রতিষ্ঠান আপনাকে ঝামেলা করবে, কষ্ট করে হলেও একটা ভিডিও করে 
                   রাখবেন, আর একটা ছবি রাখবেন। যেখানে হোক, কারণ এদের কাউকে ছাড়া যাবে না।’',
            ],
        ];
    }
    public function allProducts()
    {
        return $this->products;
    }
    public function getAllcategoryByID($id)
    {

    }

}